{
  "backend/main.mo": "Motoko actor implementing a job management system with create, process, and query operations for image-processing jobs, including rate limiting, stage tracking, and expiry cleanup.",
  "feature_evidence.json": "Feature evidence report documenting that UploadInterface.tsx was fixed to correctly extract and validate the job ID before navigating to the Results page route.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing each component's purpose and key implementation details.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the HILSA-ART GUIDE app that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with four routes (Home, HowItWorks, Contact, Results), a shared RootLayout with Header/Footer, ThemeProvider, and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering brand info, navigation links, and social media icons (Instagram, X, Behance) with gold hover effects and a copyright line.",
  "frontend/src/components/GalleryView.tsx": "Gallery component that displays the original photo and five progressive sketch stages, using backend StageResult images when available and falling back to client-side canvas generation, with a lightbox, download buttons, and per-stage status indicators.",
  "frontend/src/components/Header.tsx": "Renders a fixed navigation header with a logo, desktop nav links, a 'Start Creating' CTA button, and a responsive mobile hamburger menu using TanStack Router for active link detection.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop image upload UI that validates files, tracks upload progress, creates a processing job via backend mutations, and navigates to the results page upon success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient lifecycle, login/logout flows, delegation validity checks, and exposing identity state to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend job operations: fetching a single job with polling, listing user jobs, creating a job, processing a job, and retrying a failed job.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with a custom design token system (cream/charcoal/gold palette) for both light and dark modes, and defines utility classes for typography and color.",
  "frontend/src/lib/pencilSketchUtils.ts": "Provides utilities to generate a 5-stage pencil sketch effect from an image using canvas-based grayscale conversion, Sobel edge detection, Gaussian blur, and paper grain simulation. Exports a `SketchStage` interface and stage definitions describing each progressive rendering step.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity authentication providers wrapping the root `App` component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission and shows a success toast, alongside static contact info displaying email, location, hours, and social media links.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section with a scroll-to-upload CTA, a stage-by-stage preview of the 5-step sketch pipeline with images, and an embedded `UploadInterface` component.",
  "frontend/src/pages/HowItWorks.tsx": "Explains the 5-stage AI art transformation pipeline in a vertical timeline layout, with each stage showing an icon, description, and technical detail about the processing step.",
  "frontend/src/pages/Results.tsx": "Displays the results of a sketch generation job by fetching job status via `useJob`, handling loading, error, failed, and success states, and rendering a `GalleryView` with a retry option for failed jobs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens, border radii, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state at version 3, recording a known issue with job ID passing in the upload flow, one existing fix feature (UploadInterface job ID extraction), and one pending feature request (defensive job ID check on the Results page)."
}