{
  "backend/main.mo": "Motoko actor implementing a job management system for pencil sketch generation, with endpoints to create, process, retry, and query jobs, including rate limiting, stage tracking, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: generating four stage illustration images for a pencil drawing tutorial and updating the HowItWorks page to display those images in a 2×2 grid layout.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the HILSA-ART GUIDE application including pages, components, hooks, and utilities.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the HILSA-ART GUIDE React app, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with four routes (Home, HowItWorks, Contact, Results), wraps them in a shared RootLayout with Header and Footer, and provides ThemeProvider and Sonner toast notifications.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering the HILSA-ART brand, navigation links, social media icon buttons (Instagram, X, Behance), copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/GalleryView.tsx": "Displays a 2x2 gallery of pencil sketch stages for an uploaded image, using either backend-provided stage results or client-side generation with caching, and supports downloading a tutorial grid image.",
  "frontend/src/components/Header.tsx": "Renders a fixed top navigation header with logo, desktop nav links, a CTA button, and a collapsible mobile menu using TanStack Router for navigation.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop image upload UI that validates files, creates a backend job via mutation hooks, tracks upload progress, and navigates to the results page upon success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching jobs (with polling), listing user jobs, creating jobs, processing jobs, and retrying failed jobs against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Playfair Display, Inter, Cormorant Garamond), sets up Tailwind directives, and defines CSS custom properties for a cream/parchment light theme and dark charcoal theme including gold, ink, and sidebar tokens.",
  "frontend/src/lib/pencilSketchUtils.ts": "Utility module defining 4-stage pencil sketch metadata (labels, descriptions) and canvas-based image processing functions (grayscale conversion, Sobel edge detection, Gaussian blur, pencil noise) used to generate sketch stage previews from a source image.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and a custom InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside a contact info sidebar showing email, location, hours, and social media links.",
  "frontend/src/pages/Home.tsx": "Home page featuring a full-screen hero section with a background image and scroll-to-upload CTA, followed by a 4-stage sketch preview grid and an upload interface component, using per-stage visual styles and generated asset images.",
  "frontend/src/pages/HowItWorks.tsx": "How It Works page that displays the four pencil sketch stages in a 2×2 card grid, each with a generated stage image, numeric badge overlay, Roman numeral step label, stage name, and description.",
  "frontend/src/pages/Results.tsx": "React page component that displays job results by fetching a job by ID from the URL params, handling loading/error/failed states with appropriate UI, and rendering a GalleryView for completed jobs. Includes retry functionality for failed jobs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (gold, ink, chart, sidebar), custom shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata (version 3) describing a 4-step pencil drawing tutorial app that progressively renders portrait stages from an uploaded image, including feature history, image requirements, and architectural notes."
}