{
  "backend/main.mo": "Motoko actor implementing a job management system for a pencil sketch pipeline, with endpoints to create, process, retry, and query jobs, including rate limiting and blob storage integration.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in the pencil sketch art guide application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom properties for the design system color tokens (background, foreground, card, border, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to 'HILSA-ART GUIDE' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with five routes (Home, HowItWorks, Docs, Contact, Results/$id), wraps them in a shared RootLayout with Header/Footer, and provides ThemeProvider and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand logo, navigation links (including Docs), and social media icon links for Instagram, X, and Behance.",
  "frontend/src/components/GalleryView.tsx": "Gallery component that generates and displays four progressive pencil sketch stages client-side (with session caching), falls back to backend-provided stage images when available, and supports grid/cards view modes with a downloadable tutorial grid.",
  "frontend/src/components/Header.tsx": "Renders a fixed top navigation header with a logo, desktop nav links, a 'Start Creating' CTA button, and a responsive mobile hamburger menu using TanStack Router for navigation.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop image upload UI that validates files, tracks upload progress, creates a job via the backend, and navigates to the results page upon success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient creation, login/logout flow, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching jobs (with polling), listing user jobs, creating jobs, processing jobs, and retrying failed jobs against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, and defines a comprehensive set of CSS custom properties for light and dark themes using a warm cream/charcoal editorial palette.",
  "frontend/src/lib/pencilSketchUtils.ts": "Defines the four-stage pencil sketch pipeline metadata (labels, descriptions) and implements canvas-based image processing utilities (grayscale conversion, Sobel edge detection, Gaussian blur, pencil noise) used to generate sketch stage data URLs.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside contact info and social media links.",
  "frontend/src/pages/Documentation.tsx": "Documentation page rendering a structured reference manual for the app, including sections on the four-stage sketch pipeline, API endpoints with code blocks, and architecture details.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section with a scroll-to-upload CTA, a 4-stage sketch preview grid with styled cards, and an embedded UploadInterface component.",
  "frontend/src/pages/HowItWorks.tsx": "How It Works page displaying the four pencil sketch stages in a 2×2 image grid with Roman numeral overlays, stage names, and descriptions, plus a CTA link.",
  "frontend/src/pages/Results.tsx": "React page component that displays job results for a pencil sketch generation job, handling loading, error, failed, and success states with a gallery view and retry functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, an extended color palette (gold, ink, paper, graphite), border radius, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version 5 of a fix-and-redeploy request, listing five pending action items covering TypeScript/React errors, Motoko backend errors, GalleryView fixes, HowItWorks page fixes, and redeployment."
}