{
  "backend/main.mo": "Motoko actor implementing a job management system with create, process, retry, and query operations for image transformation jobs, including rate limiting, stage tracking, and expiry cleanup.",
  "feature_evidence.json": "Feature evidence report documenting two UI requirements: suppressing the 'NO JOB ID PROVIDED' error and the 'EXPECTED V3 RESPONSE' error message in the Results page, both mapped to Results.tsx.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their purpose within the HILSA-ART pencil sketch pipeline application.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the HILSA-ART GUIDE app, mounting the React app at the #root div and loading the main.tsx module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with four routes (Home, HowItWorks, Contact, Results), a shared RootLayout with Header/Footer, ThemeProvider, and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand logo, navigation links, social media icons (Instagram, X, Behance), copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/GalleryView.tsx": "Gallery component that renders the uploaded image and five pencil sketch stage outputs, using client-side canvas generation with session-storage caching and optional backend stage image overrides, plus lightbox and download functionality.",
  "frontend/src/components/Header.tsx": "Renders a fixed site header with a logo, desktop navigation links, a 'Start Creating' CTA button, and a responsive mobile hamburger menu using TanStack Router for navigation.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop/file-input image upload UI that validates files, tracks upload progress, creates a backend job via mutations, and navigates to the results page upon success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching a single job (with polling), fetching all user jobs, creating a job, processing a job, and retrying a failed job against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with a custom design token system (cream/charcoal/gold palette in both light and dark modes), and defines utility classes for typography and color.",
  "frontend/src/lib/pencilSketchUtils.ts": "Implements a client-side five-stage pencil sketch image processing pipeline using canvas APIs, including grayscale conversion, Sobel edge detection, Gaussian blur, hatching, cross-hatching, graphite shading, and paper texture compositing.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity authentication providers wrapping the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside contact info and social media links.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with a scroll-to-upload CTA, a five-stage sketch progression display, and the UploadInterface component for photo-to-sketch conversion.",
  "frontend/src/pages/HowItWorks.tsx": "Informational page describing the five pencil sketch pipeline stages (light hatching through final artwork) in a vertical timeline layout with icons, descriptions, and technical detail.",
  "frontend/src/pages/Results.tsx": "Results page that fetches a job by ID, handles loading/error/pending/failed states, and renders the completed pencil sketch stages via the GalleryView component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom serif/sans fonts, OKLCH-based design tokens (gold, ink, chart, sidebar colors), custom shadows, border radii, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state for a pencil sketch progression app, currently focused on fixing two UI error messages ('NO JOB ID PROVIDED' and 'EXPECTED V3 RESPONSE') that should be hidden or replaced with neutral fallbacks."
}