{
  "backend/main.mo": "Motoko actor implementing the job management backend with CRUD operations for image processing jobs, including createJob, processJob, retryFailedJob, and expiry/cleanup logic across five named drawing stages.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (updated stage names, image processing pipeline, captions) to their affected source files and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference for the current state of each component, page, hook, and utility after the stage-name update.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar) used throughout the shadcn-ui component system.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to 'HILSA-ART GUIDE' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with four routes (Home, HowItWorks, Contact, Results/$id), wraps them in a shared RootLayout with Header/Footer, and provides ThemeProvider and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering the HILSA-ART brand, navigation links, social media icon buttons (Instagram, X, Behance), a copyright line, and a caffeine.ai attribution link.",
  "frontend/src/components/GalleryView.tsx": "Displays a 5-stage portrait-to-pencil-sketch gallery with lightbox navigation, using backend stage results when available and falling back to client-side generation with session storage caching.",
  "frontend/src/components/Header.tsx": "Renders a fixed top navigation header with logo, desktop nav links, a CTA button, and a collapsible mobile menu.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop/file-input image upload UI that validates the file, creates a backend job, tracks upload progress, and navigates to the results page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (anonymous or authenticated) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching jobs (with polling), listing user jobs, creating jobs, processing jobs, and retrying failed jobs against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Playfair Display, Inter, Cormorant Garamond), sets up Tailwind directives, and defines CSS custom properties for a cream/parchment light theme and a dark charcoal theme including gold, ink, sidebar, and chart tokens.",
  "frontend/src/lib/pencilSketchUtils.ts": "Utility module that defines five pencil-sketch stage labels/descriptions and implements client-side image processing functions (grayscale conversion, Sobel edge detection, Gaussian blur, paper grain) to generate progressive sketch stage data URLs from a source image.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider (React Query) and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside a sidebar showing email, location, hours, and social media links.",
  "frontend/src/pages/Home.tsx": "Home page featuring a full-screen hero section with a CTA to scroll to the upload interface, a five-stage process overview with images and descriptions, and the UploadInterface component for photo-to-sketch transformation.",
  "frontend/src/pages/HowItWorks.tsx": "Informational page that details each of the five portrait-drawing stages (trace outlines, basic elements, shading, render/detail, polish) with descriptions, technique tips, and stage illustration images.",
  "frontend/src/pages/Results.tsx": "React page component that displays job results by fetching a job by ID from the URL params, handling loading/error/failed states, and rendering a GalleryView with retry functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (gold, ink, chart, sidebar), custom shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking the app's version, summary, existing features, and image requirements for a drawing tutorial app that guides users through five progressive portrait-drawing stages."
}