{
  "backend/main.mo": "Motoko actor implementing a job management system for image processing with CRUD operations, rate limiting (10 jobs per user per 24h), and a multi-stage processing pipeline that tracks job status and stage results.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features recorded.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their roles in the HILSA-ART portrait drawing tutorial application.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme color tokens including background, foreground, card, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point for the HILSA-ART GUIDE app, mounting the React app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with four routes (Home, HowItWorks, Contact, Results), a shared RootLayout with Header/Footer, ThemeProvider, and Sonner toast notifications.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, navigation links, social media icons (Instagram, X, Behance), copyright year, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/GalleryView.tsx": "Gallery component displaying the original photo and 5 sketch stages in a grid, with per-stage loading states, download buttons, a full-screen lightbox, and fallback to client-side canvas generation when backend images are unavailable.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with HILSA-ART logo, desktop nav links with active state styling, a 'Start Creating' CTA button, and a responsive mobile hamburger menu.",
  "frontend/src/components/UploadInterface.tsx": "React component that provides a drag-and-drop image upload interface, validates files, creates a job via the backend, tracks upload progress, and navigates to the results page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP actor (authenticated or anonymous) using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching jobs (with polling), listing user jobs, creating jobs, processing jobs, and retrying failed jobs against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines light/dark mode CSS custom properties for a parchment-and-ink design system.",
  "frontend/src/lib/pencilSketchUtils.ts": "Utility module that processes an image through five progressive pencil-sketch stages using grayscale conversion, Sobel edge detection, Gaussian blur, and paper grain effects, returning canvas data URLs for each stage.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated form (name, email, message) that simulates submission and shows a toast notification, alongside contact info and social media links.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section with a five-stage portrait process overview, a scroll-to-upload CTA, and an embedded UploadInterface component with stage detail cards.",
  "frontend/src/pages/HowItWorks.tsx": "Explains the five-stage pencil portrait drawing method in a vertical timeline layout, with each stage showing an icon, description, and detailed technique notes.",
  "frontend/src/pages/Results.tsx": "Displays job results by fetching a job by ID, handling loading/error/failed states, and rendering a GalleryView of generated pencil sketch stages with retry support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (gold, ink, sidebar, chart), custom shadows, and animation plugins.",
  "project_state.json": "Project state manifest describing the HILSA Art Guide app, its pending feature requests (enhanced sketch pipeline, gallery step labels, drawing guide walkthrough, HowItWorks previews), and required stage illustration assets."
}