{
  "backend/main.mo": "Main Motoko actor implementing a job management system for a pencil sketch pipeline, with endpoints to create, process, retry, and query jobs, including rate limiting and expiry cleanup.",
  "backend/migration.mo": "Motoko migration module defining shared job/stage types and a no-op `run` function that passes the old actor state through unchanged to the new actor.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "Pre-generated text file containing one-to-two sentence summaries of each frontend source file, describing UI components, pages, hooks, and utilities for the pencil sketch art guide app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to 'HILSA-ART GUIDE' and mounting the React root at `#root`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with five routes (Home, HowItWorks, Docs, Contact, Results), a shared RootLayout with Header/Footer, ThemeProvider, and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand logo, navigation links (including Docs), and social media icon links for Instagram, X, and Behance.",
  "frontend/src/components/GalleryView.tsx": "Gallery component that generates and displays four progressive pencil sketch stages client-side (with session caching) or from backend results, supporting grid/cards view modes and a downloadable tutorial grid image.",
  "frontend/src/components/Header.tsx": "Renders a fixed top navigation header with a logo, desktop nav links, a CTA button, and a collapsible mobile menu using TanStack Router for navigation.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop/file-input UI for uploading portrait images, validates files, creates a job via the backend, and navigates to the results page on success.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout state and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching jobs, creating jobs, processing jobs, and retrying failed jobs against the ICP backend actor, with polling for in-progress jobs.",
  "frontend/src/index.css": "Defines global CSS including Google Font imports, Tailwind directives, and a comprehensive set of CSS custom properties for light and dark theme design tokens (colors, gold, paper, ink, etc.).",
  "frontend/src/lib/pencilSketchUtils.ts": "Defines the four-stage pencil sketch pipeline metadata (labels, descriptions) and implements canvas-based image processing utilities (grayscale conversion, Sobel edge detection, Gaussian blur, pencil noise) used to generate sketch stage data URLs.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside contact info and social media links.",
  "frontend/src/pages/Documentation.tsx": "Documentation page rendering a structured reference manual with sections covering the app's workflow, four-stage sketch pipeline, and backend API endpoints, using reusable Section, CodeBlock, and ApiEndpoint components.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section with a scroll-to-upload CTA, a 4-stage sketch preview grid with per-stage visual styles, and an embedded UploadInterface component.",
  "frontend/src/pages/HowItWorks.tsx": "How It Works page displaying the four pencil sketch stages in a 2×2 image grid with Roman numeral overlays, stage names, and descriptions, plus a CTA link to try the tool.",
  "frontend/src/pages/Results.tsx": "React page component that displays pencil sketch job results by fetching job status via ID from the URL, handling loading/error/failed states, and rendering a GalleryView with retry functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), a rich oklch-based color palette (gold, ink, paper, graphite, etc.), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest tracking four pending fix requests covering frontend TypeScript/React errors, Motoko backend errors, GalleryView canvas/download issues, and HowItWorks page grid rendering for a pencil sketch app."
}