{
  "backend/main.mo": "Motoko actor implementing a job management system for a pencil sketch pipeline, with endpoints to create, process, retry, and query jobs, including rate limiting and expiry cleanup logic.",
  "feature_evidence.json": "Feature evidence report mapping two features — the pencil sketch pipeline update and the HILSA-ART dark UI theme — to their relevant source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the HILSA-ART dark-themed pencil sketch application.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark themes, including background, foreground, card, primary, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the HILSA-ART GUIDE app, mounting the React app at the `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with four routes (Home, HowItWorks, Contact, Results) inside a shared RootLayout with Header, Footer, ThemeProvider, and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Dark-themed footer component with HILSA-/ART branding, navigation links, social media icons, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/GalleryView.tsx": "Gallery component that generates and displays 5 progressive pencil sketch stages from an uploaded image URL, with loading skeletons, hover overlays for download/zoom, and a lightbox viewer.",
  "frontend/src/components/Header.tsx": "Renders a fixed navigation header with logo, desktop nav links, a 'Start Creating' CTA button, and a responsive mobile hamburger menu. Active route highlighting is handled via TanStack Router's current pathname.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop/file-input UI for uploading portrait images (JPEG/PNG/WebP, max 10MB), then creates a processing job via mutations and navigates to the results page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, and invalidates dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for interacting with the backend canister: fetching a single job (with polling), fetching all user jobs, creating a job, processing a job, and retrying a failed job.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, defines CSS custom properties for a dark art-themed design system using OKLCH colors, and sets up Tailwind base/component/utility layers with custom classes and animations.",
  "frontend/src/lib/pencilSketchUtils.ts": "Implements a multi-stage pencil sketch effect pipeline in the browser, using Gaussian blur, Sobel edge detection, and directional hatching drawn onto canvas elements, with optional stage progress callbacks.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query, Internet Identity authentication, and the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) and a success confirmation view, plus social media links and contact info.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with a call-to-action, a photo upload interface, and a showcase of the 5 progressive pencil sketch stages.",
  "frontend/src/pages/HowItWorks.tsx": "Explains the 5-stage pencil sketch pipeline (outline, hatching, cross-hatching, deep shading, finished portrait) with alternating image/text layout for each stage.",
  "frontend/src/pages/Results.tsx": "Results page that fetches a sketch job by ID and renders loading, error, failed, or completed states, displaying the generated sketch via a GalleryView component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based semantic color tokens, custom serif/display fonts, gold and ink color palettes, and shadow utilities.",
  "project_state.json": "Tracks the HILSA-ART project state including version, architectural notes, existing features (pencil sketch pipeline and UI theme updates), and pending feature requests for progressive sketch stages matching the HILSA-ART style."
}