{
  "backend/main.mo": "Motoko actor implementing a job management system for a pencil sketch pipeline, with endpoints to create, process, retry, and query jobs, including rate limiting, expiry cleanup, and stage tracking using blob storage.",
  "feature_evidence.json": "Feature evidence report listing three features: optimizing the pencil sketch pipeline in pencilSketchUtils.ts, updating GalleryView for progressive 5-stage display, and fixing Results.tsx to suppress raw error messages.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing the purpose and recent changes of each component, page, hook, and utility in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'HILSA-ART GUIDE' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with four routes (Home, HowItWorks, Contact, Results), wraps the app in ThemeProvider and a shared Header/Footer layout, and adds Sonner toast notifications.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering the HILSA-ART brand, navigation links, social media icons (Instagram, X, Behance), a copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/GalleryView.tsx": "Displays a 5-stage pencil sketch gallery for an uploaded portrait, using either backend-provided stage images or client-side canvas generation with progressive updates, lightbox navigation, and download support.",
  "frontend/src/components/Header.tsx": "Renders a fixed site header with logo, desktop navigation links, a CTA button, and a collapsible mobile menu using TanStack Router for active link detection.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop/file-input image upload UI that validates the file, creates a backend job via mutations, tracks upload progress, and navigates to the results page on success.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient lifecycle, login/logout flow, delegation validity checks, and exposing identity state to the React tree.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching a single job (with polling), listing user jobs, creating a job, processing a job, and retrying a failed job against the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Inter, Cormorant Garamond), sets up Tailwind directives, and defines light/dark theme CSS custom properties for a cream/parchment editorial design system with gold accents.",
  "frontend/src/lib/pencilSketchUtils.ts": "Client-side image processing utility that converts a photo into a 5-stage pencil sketch using canvas operations, including grayscale conversion, Sobel edge detection, separable Gaussian blur, and hatching/shading compositing.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside contact info and social media links.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section with a scroll-to-upload CTA, a 5-stage sketch progression display with images, and an embedded UploadInterface component.",
  "frontend/src/pages/HowItWorks.tsx": "Informational page describing the 5-stage pencil sketch pipeline (hatching, directional strokes, cross-hatching, graphite shading, final artwork) with icons, descriptions, and technical detail for each stage.",
  "frontend/src/pages/Results.tsx": "Results page that fetches a sketch job by ID from the URL params and renders loading, error, failed, or success states. On success, displays the uploaded image and sketch stages via the GalleryView component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (gold, ink, sidebar, chart, etc.), custom shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing the photo-to-pencil-sketch app's architecture, existing implemented features (pipeline optimization, gallery view, Results page error suppression), and pending feature requests (upload, sketch generation, gallery display, download)."
}