{
  "backend/main.mo": "Motoko actor implementing a job management system for a pencil sketch pipeline, with endpoints to create, process, retry, and query jobs, including rate limiting, stage tracking, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping two UI redesign features (card-per-step layout for GalleryView and HowItWorks) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, card, border, and chart tokens.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the root div and loading the main TypeScript module for the HILSA-ART GUIDE application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with four routes (Home, HowItWorks, Contact, Results), a shared RootLayout with Header/Footer, ThemeProvider, and Sonner toasts.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering brand identity, navigation links, and social media icons (Instagram, X, Behance) with a copyright line and caffeine.ai attribution.",
  "frontend/src/components/GalleryView.tsx": "Gallery component that displays five pencil sketch stages as vertical white cards, each with a bold step heading, instructional description, and full-width stage image sourced from either backend blob results or client-side canvas generation.",
  "frontend/src/components/Header.tsx": "Renders a fixed navigation header with a logo, desktop nav links, a CTA button, and a responsive mobile menu toggle using TanStack Router for active link detection.",
  "frontend/src/components/UploadInterface.tsx": "Provides a drag-and-drop/file-input UI for uploading portrait images, validates files, tracks upload progress, creates a backend job, and navigates to the results page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching a single job (with polling), listing user jobs, creating a job, processing a job, and retrying a failed job against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines light/dark mode CSS custom properties for the design system including colors, gold tokens, and typography utilities.",
  "frontend/src/lib/pencilSketchUtils.ts": "Defines the five pencil sketch stage labels and descriptions, and provides canvas-based image processing utilities (grayscale conversion, Sobel edge detection, Gaussian blur, paper texture) for generating sketch effect stages from an input image.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated contact form (name, email, message) that simulates submission with a toast notification, alongside contact info and social media links.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero section with a scroll-to-upload CTA, a stage pills overview, an upload interface, and a detailed breakdown of all five pencil sketch stages with images.",
  "frontend/src/pages/HowItWorks.tsx": "Explains the five-stage portrait drawing process in a card-per-step layout, showing each stage's image, description, and detailed technique tips.",
  "frontend/src/pages/Results.tsx": "Results page that fetches a job by ID, handles loading/error/failed states, and renders a GalleryView of the generated pencil sketch stages with retry and navigation options.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), oklch-based color tokens, border radii, box shadows, and animations using the typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Tracks the current project state (version 9) for a drawing tutorial app, recording existing features, requirements, architectural notes, and known issues related to the five-stage drawing progression pipeline and UI updates."
}