{
  "kind": "build_request",
  "title": "Match HILSA-ART reference style with progressive deep-shading pencil sketch stages",
  "projectName": "HILSA-ART Guide",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the client-side pencil sketch pipeline in `frontend/src/lib/pencilSketchUtils.ts` to produce output that closely matches the reference image style: clean, thin graphite-grey outlines on a pure white background for Stage 1 (Basic Outline), with each subsequent stage progressively adding deeper, denser shading — including directional hatching, cross-hatching, and rich graphite/charcoal-level dark fills by Stage 5. The final stage must have deep, high-contrast shadow regions (near-black in darkest areas) while preserving bright whites in highlights, giving the appearance of a fully shaded traditional pencil drawing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I want this exact style and the progressive styles with deep shading"
        ]
      },
      "acceptanceCriteria": [
        "Stage 1 output shows only thin, clean grey outlines on a white background, matching the reference screenshot (no fill, no shading).",
        "Each successive stage (2–5) adds progressively deeper shading so the transition from outline to fully shaded drawing is clearly visible.",
        "Stage 5 contains rich dark tones in shadow areas (close to near-black) with bright white preserved in highlight areas.",
        "The shading style uses hatching/cross-hatching strokes consistent with traditional pencil technique rather than flat grey fills.",
        "All 5 stages render correctly on a real portrait photo upload without visual glitches or fully black/white outputs."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the UI theme across the app (Header, Footer, GalleryView, Home, Results, HowItWorks pages) to exactly match the HILSA-ART reference UI: deep near-black background (`#1a1a1a` or similar), gold/amber accent color for the brand name 'ART' portion and active nav links, light grey/white body text, and dark card containers with subtle borders for sketch stage cards. Stage label (e.g. 'STAGE 1') should appear in the gold accent color above the stage title in white, exactly as shown in the reference screenshot.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I want this exact style"
        ]
      },
      "acceptanceCriteria": [
        "App background is deep near-black across all pages.",
        "Header shows 'HILSA-' in white and 'ART' in gold/amber, matching reference branding.",
        "Active navigation links are styled in gold/amber to match the reference.",
        "Sketch stage cards have a dark container background with the stage number in gold and stage title in white.",
        "Footer matches the reference: dark background, centered HILSA-ART branding with gold accent, grey navigation links, copyright line."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, frontend/src/components/ui).",
    "All image processing must remain client-side in pencilSketchUtils.ts — do not route generated sketch images through the backend.",
    "Keep all Motoko logic in backend/main.mo; do not alter backend schema unless required."
  ],
  "nonGoals": [
    "Adding new sketch stages beyond the existing 5-stage pipeline.",
    "Changing the backend job management logic.",
    "Implementing any AI or server-side image processing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}