{
  "kind": "build_request",
  "title": "Step-by-step processed image drawing guide with stage-by-stage progression",
  "projectName": "HILSA Art Guide",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enhance the five-stage pencil sketch pipeline in pencilSketchUtils.ts so that each stage produces a clearly distinct, progressive visual output: Stage 1 shows only the basic skull/proportion construction lines (very faint, structural), Stage 2 adds rough contour outlines, Stage 3 layers in mid-tone shading, Stage 4 refines details and adds darker values, and Stage 5 delivers the fully rendered portrait with complete tonal range and paper grain texture.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "create step by step processed image which guides to draw stage by stage"
        ]
      },
      "acceptanceCriteria": [
        "Each of the 5 stages produces a visually distinct canvas output that is clearly more complete than the previous stage",
        "Stage 1 output is the most minimal/sparse, Stage 5 is the most detailed/complete",
        "Transitions between stages are smooth and progressive, not abrupt",
        "All stages still derive from the original uploaded image"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the GalleryView component to display each stage with a step label (e.g. 'Step 1: Construction Lines', 'Step 2: Contour Outline', etc.), an instructional caption below each image explaining what the artist should focus on or practice at that stage, and a clear visual indicator showing which step the user is currently viewing (e.g. a numbered progress indicator or breadcrumb).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "create step by step processed image which guides to draw stage by stage"
        ]
      },
      "acceptanceCriteria": [
        "Each stage panel shows a numbered step label and a descriptive title",
        "A short instructional caption (1–2 sentences) is displayed beneath each stage image",
        "A progress indicator (e.g. '2 of 5') is visible when navigating between stages in the lightbox",
        "Step titles and captions match the actual visual content of that stage"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a dedicated 'Drawing Guide' view or mode on the Results page that presents stages sequentially in a step-by-step walkthrough layout: one stage visible at a time, with 'Previous Step' and 'Next Step' navigation buttons, the instructional caption, and a thumbnail strip at the bottom showing all 5 stages so the user can jump to any step directly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "guides to draw stage by stage"
        ]
      },
      "acceptanceCriteria": [
        "A 'Drawing Guide' button or tab is available on the Results page for completed jobs",
        "The guide view shows one stage at a time with Previous/Next controls",
        "A thumbnail strip with all 5 stages is visible at the bottom; clicking a thumbnail jumps to that step",
        "The current step number and total step count are always visible",
        "The guide view can be exited to return to the standard gallery view"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the HowItWorks page timeline to include a small representative preview image alongside each of the five stage entries, visually demonstrating what the output looks like at that stage of the drawing process.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "step by step processed image which guides to draw stage by stage"
        ]
      },
      "acceptanceCriteria": [
        "Each of the five timeline entries on the HowItWorks page includes a small illustrative image or icon representing that drawing stage",
        "The preview images are consistent in size and style across all five stages",
        "The page layout remains clean and readable with the added visual elements"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ (useActor.ts, useInternetIdentity.ts) or frontend/src/main.tsx",
    "Do not modify files under frontend/src/components/ui/",
    "All Motoko logic must remain in backend/main.mo as a single actor",
    "Stage processing must continue to be canvas-based and client-side via pencilSketchUtils.ts"
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing the job data model",
    "Supporting drawing media other than pencil sketch",
    "Adding video or animation-based tutorials",
    "Allowing users to edit or annotate the stage images"
  ],
  "imageRequirements": {
    "required": [
      "Minimal pencil construction lines illustration showing skull proportions and basic head structure, white background (stage1-construction.dim_400x400.png)",
      "Pencil contour outline illustration of a face with no shading, white background (stage2-contour.dim_400x400.png)",
      "Pencil sketch with light mid-tone shading on a face, white background (stage3-shading.dim_400x400.png)",
      "Detailed pencil portrait with refined features and darker values, white background (stage4-details.dim_400x400.png)",
      "Fully rendered pencil portrait with complete tonal range and paper grain texture, white background (stage5-complete.dim_400x400.png)"
    ],
    "edits": []
  }
}