{
  "kind": "build_request",
  "title": "Redesign Drawing Guide layout to match step-card style with stage image + description per card",
  "projectName": "HILSA Art Guide",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Redesign the Drawing Guide walkthrough view on the Results page so that each stage is presented as a distinct card block containing: (1) a bold step title (e.g. 'Step 1: Trace the Outlines'), (2) a paragraph of instructional body text explaining what to do at that stage, and (3) a full-width rounded image showing the processed stage output — all stacked vertically, matching the card-per-step layout shown in the reference screenshot (white card on light grey background, title in large bold sans-serif, description text below it, then the stage image in a rounded rectangle container). All five stage cards should be visible on the page by scrolling, one after another.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Will you generate each stages of the image similar to this"
        ]
      },
      "acceptanceCriteria": [
        "Each of the five drawing stages is rendered as its own card with a white background and rounded corners on a light grey/cream page background.",
        "Each card contains a bold step heading (e.g. 'Step 1: Trace the Outlines'), a body paragraph with the existing instructional caption for that stage, and the processed stage image displayed in a full-width rounded image container below the text.",
        "All five stage cards are displayed sequentially in a vertically scrollable layout — no pagination or hidden stages.",
        "Stage image outputs (generated client-side) are displayed at appropriate resolution inside each card.",
        "The typography uses a large, bold sans-serif for step titles and a regular-weight body font for descriptions, consistent with the reference screenshot style.",
        "The layout is responsive and renders correctly on both desktop and mobile screen widths."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the HowItWorks page timeline to use the same card-per-step visual layout: each stage entry becomes a standalone card with the step number and title as a bold heading, the descriptive body text beneath it, and a representative stage preview image below the text — mirroring the reference screenshot's structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Will you generate each stages of the image similar to this"
        ]
      },
      "acceptanceCriteria": [
        "Each of the five stages on the HowItWorks page is presented as a card matching the visual style of the reference screenshot.",
        "Each card shows the stage title as a bold heading, the stage description as body text, and a placeholder or static representative sketch-style image.",
        "Cards are arranged vertically and fully visible without toggling or expanding."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui.",
    "Preserve all existing stage label strings and instructional caption copy already implemented — do not change the text content, only the layout and presentation."
  ],
  "nonGoals": [
    "Changing the five stage names, captions, or instructional copy.",
    "Modifying the client-side image processing logic in pencilSketchUtils.ts.",
    "Changing the backend job processing pipeline.",
    "Adding new authentication or user account features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}