{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace pencil sketch stages with portrait drawing stages and update style",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Update stage labels throughout the app to reflect the five new portrait drawing stages: Trace Outlines, Basic Elements, Slight Shading, Render and Detail, Polish",
      "acceptanceCriteria": [
        "Stage 1 is labelled 'Trace the outlines of the portrait' everywhere in the UI",
        "Stage 2 is labelled 'Draw the basic elements' everywhere in the UI",
        "Stage 3 is labelled 'Have a slight shading' everywhere in the UI",
        "Stage 4 is labelled 'Render and detail' everywhere in the UI",
        "Stage 5 is labelled 'Polish' everywhere in the UI",
        "No old pencil sketch stage names (Construction Lines, Contour Outline, Basic Shading, Detail Pass, Final Render, etc.) remain visible anywhere in the UI",
        "GalleryView step labels reflect the new stage names",
        "HowItWorks page timeline reflects the new stage names",
        "Drawing Guide walkthrough stage titles and captions reflect the new stage names"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GalleryView.tsx",
          "operation": "modify",
          "description": "Update the stage labels, captions, and all references to the five drawing stages. Replace any hardcoded or computed stage names with the new portrait drawing stage labels: 'Trace the outlines of the portrait', 'Draw the basic elements', 'Have a slight shading', 'Render and detail', 'Polish'. Update per-stage captions in the gallery display to match the new stage descriptions."
        },
        {
          "path": "frontend/src/pages/HowItWorks.tsx",
          "operation": "modify",
          "description": "Replace the timeline stage definitions with the five new portrait drawing stages. Update stage titles, descriptions, and technique notes to reflect: Stage 1 — Trace the outlines of the portrait, Stage 2 — Draw the basic elements, Stage 3 — Have a slight shading, Stage 4 — Render and detail, Stage 5 — Polish. Ensure all old pencil sketch terminology is removed."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Update the hero section stage overview and any stage detail cards to use the new portrait drawing stage labels. Replace references to old pencil sketch stages with the five new stages. Update any stage-related copy or captions in the upload interface section."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update client-side image processing pipeline to produce progressive portrait drawing stages with distinct visual styles",
      "acceptanceCriteria": [
        "Each of the 5 stages produces a visually distinct output that matches its stage description",
        "Stage 1 output shows only faint traced outlines",
        "Stage 2 output shows basic elements with clean line work",
        "Stage 3 output shows visible light shading added over stage 2",
        "Stage 4 output shows detailed rendering and texture",
        "Stage 5 output looks polished and refined compared to stage 4",
        "The pipeline processes a user-uploaded image and returns 5 progressive canvas data URLs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/pencilSketchUtils.ts",
          "operation": "modify",
          "description": "Replace the uniform pencil-sketch filter approach with per-stage visual treatments that produce distinct outputs for each of the five portrait drawing stages. Stage 1 should apply minimal edge detection to create a faint outline/trace. Stage 2 should produce clean structural line work with basic facial elements visible. Stage 3 should layer light tonal shading over the stage 2 output. Stage 4 should add rendered detail, texture, and tonal depth. Stage 5 should apply polishing filters for a refined final illustration. Maintain the existing function signature that returns an array of canvas data URLs."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update instructional captions for each stage to match new portrait drawing workflow",
      "acceptanceCriteria": [
        "Each stage has an updated instructional caption relevant to its new name and technique",
        "HowItWorks page technique notes are updated to reflect the new five stages",
        "GalleryView per-stage captions are updated",
        "Drawing Guide walkthrough captions are updated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GalleryView.tsx",
          "operation": "modify",
          "description": "Update per-stage instructional captions to match the new portrait drawing stages. Ensure captions describe: Stage 1 — tracing outlines, Stage 2 — drawing basic elements, Stage 3 — applying slight shading, Stage 4 — rendering and detailing, Stage 5 — polishing the portrait. Remove any references to old pencil sketch techniques."
        },
        {
          "path": "frontend/src/pages/HowItWorks.tsx",
          "operation": "modify",
          "description": "Update technique notes and descriptions in the timeline for each of the five portrait drawing stages. Ensure each stage description explains the portrait drawing technique relevant to that stage (tracing, basic elements, shading, rendering, polishing)."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Update any walkthrough or instructional captions in the stage detail cards or process overview to reflect the new portrait drawing workflow and stage descriptions."
        }
      ]
    }
  ]
}