{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step-by-step processed image drawing guide with stage-by-stage progression",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Enhance the five-stage pencil sketch pipeline so each stage produces clearly distinct, progressive visual output",
      "acceptanceCriteria": [
        "Each of the 5 stages produces a visually distinct canvas output that is clearly more complete than the previous stage",
        "Stage 1 output is the most minimal/sparse, Stage 5 is the most detailed/complete",
        "Transitions between stages are smooth and progressive, not abrupt",
        "All stages still derive from the original uploaded image"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/pencilSketchUtils.ts",
          "operation": "modify",
          "description": "Refactor the generateSketchStage function to produce five clearly distinct progressive outputs: Stage 1 (Construction Lines) should show only faint structural/proportion lines using very light edge detection and minimal processing; Stage 2 (Contour Outline) should add rough contour outlines with stronger edge detection but no shading; Stage 3 (Mid-tone Shading) should layer in grayscale mid-tones with moderate blur and initial paper grain; Stage 4 (Refined Details) should add darker values, increased contrast, and refined edge details; Stage 5 (Complete Portrait) should deliver the fully rendered result with complete tonal range, maximum contrast, and full paper grain texture. Adjust Sobel thresholds, blur radii, contrast factors, and grain opacity progressively across stages to ensure each stage is visibly more complete than the previous."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update GalleryView to display each stage with step labels, instructional captions, and progress indicators",
      "acceptanceCriteria": [
        "Each stage panel shows a numbered step label and a descriptive title",
        "A short instructional caption (1–2 sentences) is displayed beneath each stage image",
        "A progress indicator (e.g. '2 of 5') is visible when navigating between stages in the lightbox",
        "Step titles and captions match the actual visual content of that stage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/pencilSketchUtils.ts",
          "operation": "modify",
          "description": "Add an instructionalCaption field to each stage definition in the SKETCH_STAGES array. Stage 1 caption should guide the artist to focus on basic skull proportions and construction lines. Stage 2 should emphasize capturing the overall contour and main shapes. Stage 3 should explain mid-tone shading and form building. Stage 4 should focus on refining features and adding darker accents. Stage 5 should describe final polish, tonal range completion, and texture finishing."
        },
        {
          "path": "frontend/src/components/GalleryView.tsx",
          "operation": "modify",
          "description": "Update the gallery grid and lightbox to display step labels in the format 'Step X: [Stage Name]' above each image. Add the instructional caption text below each stage image in both grid and lightbox views. In the lightbox navigation, add a progress indicator showing 'Step X of 5' near the navigation controls. Ensure captions are styled for readability and positioned consistently beneath each stage preview."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a dedicated Drawing Guide view with sequential step-by-step walkthrough layout",
      "acceptanceCriteria": [
        "A 'Drawing Guide' button or tab is available on the Results page for completed jobs",
        "The guide view shows one stage at a time with Previous/Next controls",
        "A thumbnail strip with all 5 stages is visible at the bottom; clicking a thumbnail jumps to that step",
        "The current step number and total step count are always visible",
        "The guide view can be exited to return to the standard gallery view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DrawingGuideView.tsx",
          "operation": "create",
          "description": "Create a new DrawingGuideView component that accepts a Job prop and displays a sequential step-by-step walkthrough. The component should maintain current step state (1-5), show one large stage image at a time with its step label and instructional caption prominently displayed. Add Previous and Next navigation buttons (disable Previous on step 1, Next on step 5). Display a step counter (e.g. 'Step 2 of 5') at the top. Include a horizontal thumbnail strip at the bottom showing all 5 stage thumbnails; highlight the current step thumbnail and allow click-to-jump navigation. Add a Close/Exit button to return to standard gallery mode. Use the same stage data source logic as GalleryView (backend stages or fallback to client-side generation)."
        },
        {
          "path": "frontend/src/pages/Results.tsx",
          "operation": "modify",
          "description": "Add a view mode state (gallery or guide) and a 'Drawing Guide' button that appears when a job is completed. When clicked, switch to guide mode and render the DrawingGuideView component instead of GalleryView. The DrawingGuideView should receive a callback to switch back to gallery mode. Position the mode toggle button prominently near the job title or action area."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update HowItWorks timeline to include representative preview images for each stage",
      "acceptanceCriteria": [
        "Each of the five timeline entries on the HowItWorks page includes a small illustrative image or icon representing that drawing stage",
        "The preview images are consistent in size and style across all five stages",
        "The page layout remains clean and readable with the added visual elements"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HowItWorks.tsx",
          "operation": "modify",
          "description": "Update each of the five timeline step entries to include a small preview image demonstrating that stage's visual output. Use the generated stage preview images at frontend/public/assets/generated/stage1-construction.dim_400x400.png, frontend/public/assets/generated/stage2-contour.dim_400x400.png, frontend/public/assets/generated/stage3-shading.dim_400x400.png, frontend/public/assets/generated/stage4-details.dim_400x400.png, and frontend/public/assets/generated/stage5-complete.dim_400x400.png. Position each image alongside or above its corresponding timeline entry. Size images consistently (e.g. 200x200px or 150x150px) and apply consistent styling (border, shadow, or rounded corners) to maintain visual harmony. Ensure the layout remains clean and the text descriptions are still easily readable."
        }
      ]
    }
  ]
}