{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign Drawing Guide layout to match step-card style with stage image + description per card",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Redesign the Drawing Guide walkthrough view on the Results page so that each stage is presented as a distinct card block containing a bold step title, instructional body text, and a full-width rounded image showing the processed stage output",
      "acceptanceCriteria": [
        "Each of the five drawing stages is rendered as its own card with a white background and rounded corners on a light grey/cream page background.",
        "Each card contains a bold step heading (e.g. 'Step 1: Trace the Outlines'), a body paragraph with the existing instructional caption for that stage, and the processed stage image displayed in a full-width rounded image container below the text.",
        "All five stage cards are displayed sequentially in a vertically scrollable layout — no pagination or hidden stages.",
        "Stage image outputs (generated client-side) are displayed at appropriate resolution inside each card.",
        "The typography uses a large, bold sans-serif for step titles and a regular-weight body font for descriptions, consistent with the reference screenshot style.",
        "The layout is responsive and renders correctly on both desktop and mobile screen widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GalleryView.tsx",
          "operation": "modify",
          "description": "Replace the current gallery layout with a vertical card-based layout where each of the five stages is rendered as a standalone card. Each card should have: (1) a white background with rounded corners, (2) a bold step title heading using the existing stage label (e.g., 'Step 1: Trace the Outlines'), (3) the existing instructional caption as body text below the title, and (4) the processed stage image displayed full-width within the card with rounded corners. Remove the lightbox viewer and download buttons. Ensure all five cards are visible in a scrollable vertical stack on a light grey/cream background. Use large bold sans-serif typography for titles (e.g., text-2xl font-bold) and regular body font for descriptions. Preserve all existing stage label strings and instructional caption copy from pencilSketchUtils.ts. Maintain responsive behavior for desktop and mobile."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update the HowItWorks page timeline to use the same card-per-step visual layout with step number, title, descriptive body text, and representative stage preview image",
      "acceptanceCriteria": [
        "Each of the five stages on the HowItWorks page is presented as a card matching the visual style of the reference screenshot.",
        "Each card shows the stage title as a bold heading, the stage description as body text, and a placeholder or static representative sketch-style image.",
        "Cards are arranged vertically and fully visible without toggling or expanding."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HowItWorks.tsx",
          "operation": "modify",
          "description": "Replace the current vertical timeline layout with a card-based layout matching the reference screenshot style. Each of the five stages should be rendered as a distinct card with: (1) a white background and rounded corners, (2) a bold step heading combining the stage number and name (e.g., 'Step 1: Trace the Outlines'), (3) the existing stage description as body text below the heading, and (4) a static representative stage preview image displayed full-width within the card with rounded corners. Use the generated stage preview images from frontend/public/assets/generated/ (stage1-trace-outlines.dim_600x600.png, stage2-hatching.dim_600x600.png, stage3-crosshatch.dim_600x600.png, stage4-render-detail.dim_600x600.png, stage5-polish.dim_600x600.png). Remove the timeline connector lines and icons. Arrange cards vertically in a scrollable stack on a light grey/cream background. Use large bold sans-serif typography for titles and regular body font for descriptions. Preserve all existing stage descriptions and technique tips. Ensure responsive layout for desktop and mobile."
        }
      ]
    }
  ]
}