{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optimize 5-Stage Pencil Sketch Pipeline for Speed and Visual Fidelity",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Optimize the client-side pencil sketch pipeline to generate all 5 stages significantly faster by reusing intermediate buffers, reducing blur kernels for early stages, and skipping heavy computations for stages 1-2",
      "acceptanceCriteria": [
        "All 5 sketch stages are generated and displayed noticeably faster than before (target: under 3 seconds total on a mid-range device)",
        "Stage 1 shows only very faint basic outlines with minimal hatching — lightest pencil strokes, nearly white",
        "Stage 2 shows cleaner, slightly darker outlines with basic facial structure — light sketch feel",
        "Stage 3 adds defined facial features (eyes, nose, mouth) with medium line weight",
        "Stage 4 introduces hair strokes and light shading/hatching",
        "Stage 5 is the fully detailed portrait with deep cross-hatching, graphite shading, and paper texture — matching the bottom-right panel of the reference image",
        "No stage re-runs grayscale conversion or Sobel edge detection more than once (share computed data across stages)",
        "Processing does not block the UI — show a progress indicator while stages are being generated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/pencilSketchUtils.ts",
          "operation": "modify",
          "description": "Refactor the five-stage pencil sketch pipeline to compute grayscale and Sobel edge detection only once at the beginning, then reuse those intermediate ImageData buffers across all stages. Run stage computations in a single optimized pass where feasible. Reduce Gaussian blur kernel radius for stages 1-3 (lighter stages need less blur). Skip cross-hatching and graphite shading entirely for stages 1-2 to minimize processing time. Adjust intensity/opacity parameters so stage 1 produces very faint outlines (nearly white), stage 2 produces light sketch structure, stage 3 adds defined facial features, stage 4 introduces hair and light shading, and stage 5 delivers the fully detailed portrait with deep cross-hatching, graphite shading, and paper texture matching the reference image. Ensure the pipeline runs non-blocking and exposes progress callbacks for UI updates."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update GalleryView to display all 5 stages in a responsive grid with progressive rendering as each stage completes",
      "acceptanceCriteria": [
        "5 stage cards are visible in a responsive grid (1 column mobile → 5 columns desktop)",
        "Each card shows a skeleton/loading placeholder until its stage finishes computing",
        "Stage label and subtitle (e.g., 'Stage 1 — Light Outline', 'Stage 5 — Final Artwork') are shown below each image",
        "Each card has a download button that saves that stage as a PNG",
        "Stages appear one-by-one as they complete, not all at once after a long wait"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GalleryView.tsx",
          "operation": "modify",
          "description": "Refactor the GalleryView component to display all 5 pencil sketch stages in a clean horizontal scrollable strip on mobile and a 5-column grid on desktop. Each stage card should render a skeleton/loading placeholder initially, then update progressively as its canvas output becomes ready (do not wait for all 5 to complete). Add a stage label ('Stage 1' through 'Stage 5') and a descriptive subtitle below each image (e.g., 'Stage 1 — Light Outline', 'Stage 2 — Basic Structure', 'Stage 3 — Defined Features', 'Stage 4 — Hair & Shading', 'Stage 5 — Final Artwork'). Include a download button on each card that saves that specific stage as a PNG. Leverage the optimized pencilSketchUtils pipeline's progress callbacks to render stages incrementally as they complete, ensuring a responsive user experience."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix Results page to suppress raw error messages ('NO JOB ID PROVIDED', 'EXPECTED V3 RESPONSE') and replace them with neutral fallback states",
      "acceptanceCriteria": [
        "The string 'NO JOB ID PROVIDED' never appears in the UI",
        "The string 'EXPECTED V3 RESPONSE' never appears in the UI",
        "When job ID is missing, a friendly message such as 'No sketch job found. Please upload a photo to get started.' is shown with a link back to the home page",
        "When the backend returns an unexpected response format, a neutral fallback message is shown without exposing internal error strings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Results.tsx",
          "operation": "modify",
          "description": "Update the Results page to suppress and hide the raw error messages 'NO JOB ID PROVIDED' and 'EXPECTED V3 RESPONSE'. When the job ID is missing from the URL, replace the error with a friendly fallback message: 'No sketch job found. Please upload a photo to get started.' Include a button or link navigating back to the home page. When the backend returns an unexpected response format or structure, display a neutral error state without exposing internal error strings. Ensure all error handling provides a user-friendly experience without leaking technical details."
        }
      ]
    }
  ]
}