{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace HowItWorks stage images with 4-step pencil style renders of uploaded image",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Generate four new stage illustration images representing each step of the pencil drawing tutorial, depicting the same female portrait subject progressing from loose construction lines to a fully rendered graphite drawing",
      "acceptanceCriteria": [
        "Four PNG images are present in frontend/public/assets/generated/ with the specified filenames",
        "Each image visually represents its stated pencil drawing stage",
        "All four images depict the same portrait subject for visual continuity"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/stage1-basic-construction.dim_800x800.png",
          "operation": "create",
          "description": "Generate a female portrait image at the basic construction stage showing very light, loose graphite pencil lines forming an oval head shape with horizontal and vertical construction guidelines crossing at the face center, minimal detail, sketch-like appearance. This image will be used in the HowItWorks page tutorial section to represent Step I."
        },
        {
          "path": "frontend/public/assets/generated/stage2-refined-lineart.dim_800x800.png",
          "operation": "create",
          "description": "Generate a female portrait image at the refined line art stage showing clean, darker pencil outlines defining eyes with irises and lashes, a defined nose bridge and tip, lips with cupid's bow, and the outer silhouette of flowing hair with no shading yet. This continues the progression from stage1 and will represent Step II in the tutorial."
        },
        {
          "path": "frontend/public/assets/generated/stage3-hair-detail.dim_800x800.png",
          "operation": "create",
          "description": "Generate a female portrait image at the hair and detail development stage showing pencil-drawn hair strand direction lines with layered strokes, detailed eyebrows and eye shading, light contour shadow lines on cheekbones and jaw, and subtle crosshatching on the neck. This continues the progression from stage2 and will represent Step III in the tutorial."
        },
        {
          "path": "frontend/public/assets/generated/stage4-final-shaded.dim_800x800.png",
          "operation": "create",
          "description": "Generate a female portrait image at the final shaded portrait stage showing a fully rendered graphite drawing with smooth blended tonal shading across the face and neck, rich dark hair with volume and highlight streaks, deep shadows under the chin, and polished professional pencil portrait quality. This completes the progression from stage3 and will represent Step IV in the tutorial."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the current HowItWorks page tutorial section with a new layout using the four generated stage images, displaying Roman numeral indicators, numeric badges, stage titles, and descriptions for each step",
      "acceptanceCriteria": [
        "The HowItWorks page displays exactly 4 stage cards in sequence",
        "Each card renders its corresponding generated stage image (stage1 through stage4)",
        "Roman numeral labels (Step I, Step II, Step III, Step IV) are visible per card",
        "Numeric badges (01, 02, 03, 04) are displayed per card",
        "Stage title and description text match the specification: Basic Construction, Refined Line Art, Hair & Detail Development, Final Shaded Portrait",
        "Old/previous layout code for the tutorial section is removed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HowItWorks.tsx",
          "operation": "modify",
          "description": "Replace the existing 4-stage tutorial section with a new layout that uses the four generated stage images from frontend/public/assets/generated/ (stage1-basic-construction.dim_800x800.png through stage4-final-shaded.dim_800x800.png). Each stage card must display: Roman numeral step indicator (Step I–IV), numeric badge (01–04), stage title ('Basic Construction', 'Refined Line Art', 'Hair & Detail Development', 'Final Shaded Portrait'), and stage description. Remove the old layout code that conflicts with this new structure, ensuring the element at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/section[3]/div[1]/div[2]/div[1]/div[2]/img[1] and its surrounding stage card are replaced to use the new images. Maintain the overall page structure with hero section and additional tutorial content sections intact."
        }
      ]
    }
  ]
}